# Cleaning Datasets Using Pandas

In [1]:
import pandas as pd

In [2]:
df_dataset_3 = pd.read_csv('dataset_3.csv')

_As you can see our first dataset contains very irregular values in the demographic column._
_It seems like gender and age are combined in this column._

In [3]:
df_dataset_3.head()

       iso2  year demographic  cases
37765    ma  1994      m35-44    200
112546   lc  2003         f65      1
44942    sc  2007      m45-54    422
101567   mt  1986      f45-54    134
47341    cr  1984      m55-64      3

_In order to separate gender ('sex') and age, we have to create new columns and assign them_
_values using the existing entries by substrings._

In [4]:
df_dataset_3 = (df_dataset_3.assign(
sex = lambda x: x.demographic.str[0].astype(str),
age = lambda x: x.demographic.str[1:].astype(str)).drop('demographic', axis=1))

In [5]:
df_dataset_3.sample(5)

       iso2  year  cases sex    age
101567   mt  1986    134   f  45-54
44942    sc  2007    422   m  45-54
47341    cr  1984      3   m  55-64
112546   lc  2003      1   f     65
37765    ma  1994    200   m  35-44

_Our data set makes a lot more sense now, however we should make it prettier._
_All we're going to do now is adjust the formatting so that it's readable._

In [6]:
df_dataset_3 = (df_dataset_3.replace(to_replace = ['m', 'f', '65'],
                                    value = ['Male', 'Female', '65+']))

In [7]:
df_dataset_3

       iso2  year  cases     sex    age
37765    ma  1994    200    Male  35-44
112546   lc  2003      1  Female    65+
44942    sc  2007    422    Male  45-54
101567   mt  1986    134  Female  45-54
47341    cr  1984      3    Male  55-64

_Moving on to our second dataset!_

In [8]:
df_dataset_2 = pd.read_csv('dataset_2.csv')

In [9]:
df_dataset_2.head()

,species,habitat,weight,length,lat_lon,date
0,Alligator mississippiensis,swamp,431,4.0,29.531|-82.184,sep-15-2015
1,Puma concolor,forest,125,2.2,29.125|-81.682,aug-10-2015
2,Ursus amricanus,forest,88,133.0,29.429|-80.562,jul-13-2015

_Here, we are going to split our species column in two columns: genus and species._

In [10]:
df_modify = df_dataset_2['species'].apply(lambda x: x.split())

In [11]:
df_dataset_2['genus'] = df_modify.apply(lambda x: x[0])

In [12]:
df_dataset_2['species'] = df_modify.apply(lambda x: x[1])

In [13]:
df_dataset_2

,species,habitat,weight,length,lat_lon,date,genus
0,mississippiensis,swamp,431,4.0,29.531|-82.184,sep-15-2015,Alligator
1,concolor,forest,125,2.2,29.125|-81.682,aug-10-2015,Puma
2,amricanus,forest,88,133.0,29.429|-80.562,jul-13-2015,Ursus

_Next, we should organize latitude and longitude into individual columns._

In [14]:
df_modify = df_dataset_2['lat_lon'].apply(lambda x: x.split('|'))

In [15]:
df_dataset_2['latitude'] = df_modify.apply(lambda x: x[0])

In [16]:
df_dataset_2['longitude'] = df_modify.apply(lambda x: x[1])

In [17]:
df_dataset_2.drop('lat_lon',axis=1)

,species,habitat,weight,length,date,genus,latitude,longitude
0,mississippiensis,swamp,431,4.0,sep-15-2015,Alligator,29.531,-82.184
1,concolor,forest,125,2.2,aug-10-2015,Puma,29.125,-81.682
2,amricanus,forest,88,133.0,jul-13-2015,Ursus,29.429,-80.562

_Finally, we will tidy up our final dataset_

In [18]:
df_dataset_1 = pd.read_csv('dataset_1.csv')

In [19]:
df_dataset_1

             name   phone_number         dob  location      job  degree
0     Stacy Adams   313-555-2219   7/23/1998        fl      NaN      no
1    Alice Walker   212-982-1112         NaN        az   banker       y
2  Brandon Jermey   646-555-1236    12/18/93        ny   banker     yes
3    Robert jones   212-999-6597   8/26/1956        nc  retired       n

In [20]:
df_modify = df_dataset_1['name'].apply(lambda x: x.split())

_First order of businss is the split first and last name into separate columns_

In [21]:
df_dataset_1['first_name'] = df_modify.apply(lambda x: x[0])

In [22]:
df_dataset_1['last_name'] = df_modify.apply(lambda x: x[1])

In [23]:
df = df_dataset_1.drop('name', axis=1)

_Next, we need to rearrange our columns, putting first and last name columns first (reading left to right)_

In [24]:
cols = df.columns.to_list()

In [25]:
cols

['phone_number',
 ' dob',
 ' location',
 ' job',
 ' degree',
 'first_name',
 'last_name']

In [26]:
cols = cols[-2:] + cols[:-2]

In [27]:
df = df[cols]

In [28]:
df

  first_name last_name   phone_number         dob  location      job  degree
0      Stacy     Adams   313-555-2219   7/23/1998        fl      NaN      no
1      Alice    Walker   212-982-1112         NaN        az   banker       y
2    Brandon    Jermey   646-555-1236    12/18/93        ny   banker     yes
3     Robert     jones   212-999-6597   8/26/1956        nc  retired       n

_Let's do some final touches to our data so that it is presentable._

In [29]:
df = (df.replace(to_replace = ['no','n', 'y', 'yes'],value = ['N', 'N', 'Y', 'Y']))

_Here, we use Pandas' built-in fill NaN function to replace all NaNs with 'None'_

In [30]:
df.fillna('None', inplace=True)

In [31]:
df

  first_name last_name   phone_number         dob  location      job  degree
0      Stacy     Adams   313-555-2219   7/23/1998        fl     None       N
1      Alice    Walker   212-982-1112        None        az   banker       Y
2    Brandon    Jermey   646-555-1236    12/18/93        ny   banker       Y
3     Robert     jones   212-999-6597   8/26/1956        nc  retired       N